[
    {
        "text_input": "What are the top attractions in Da Nang?",
        "output": "The top attractions in Da Nang include Bana Hills, Dragon Bridge, Marble Mountains, and My Khe Beach."
    },
    {
        "text_input": "What is the best time to visit Da Nang?",
        "output": "The best time to visit Da Nang is from April to August during the dry season."
    },
    {
        "text_input": "What is the weather like in Da Nang?",
        "output": "Da Nang has a tropical climate with a dry season from April to August and a rainy season from September to March."
    },
    {
        "text_input": "What are some famous foods in Da Nang?",
        "output": "Famous foods in Da Nang include Mi Quang, Banh Xeo, and fresh seafood."
    },
    {
        "text_input": "How do I get to Da Nang?",
        "output": "You can get to Da Nang by plane, train, or bus. Da Nang International Airport connects to many cities in Asia."
    },
    {
        "text_input": "What is Bana Hills known for?",
        "output": "Bana Hills is known for the Golden Bridge, amusement parks, and its scenic mountain views."
    },
    {
        "text_input": "What is Dragon Bridge in Da Nang?",
        "output": "Dragon Bridge is a famous bridge in Da Nang that is designed like a dragon. It breathes fire and water on weekends at 9 PM."
    },
    {
        "text_input": "Are there beaches in Da Nang?",
        "output": "Yes, Da Nang is famous for its beautiful beaches like My Khe Beach and Non Nuoc Beach."
    },
    {
        "text_input": "What is the Marble Mountains in Da Nang?",
        "output": "The Marble Mountains are a cluster of five limestone hills, each named after an element. They are popular for their caves and temples."
    },
    {
        "text_input": "Can I travel to Hoi An from Da Nang?",
        "output": "Yes, Hoi An is only 30 kilometers from Da Nang, and you can travel by taxi, motorbike, or bus."
    },
    {
        "text_input": "What festivals are celebrated in Da Nang?",
        "output": "Da Nang celebrates the International Fireworks Festival, Tet (Vietnamese New Year), and Mid-Autumn Festival."
    },
    {
        "text_input": "What are some shopping options in Da Nang?",
        "output": "Popular shopping places include Han Market, Con Market, and Vincom Plaza."
    },
    {
        "text_input": "Is Da Nang good for family vacations?",
        "output": "Yes, Da Nang is family-friendly with beaches, Bana Hills, and family resorts like InterContinental Da Nang."
    },
    {
        "text_input": "What are some luxury hotels in Da Nang?",
        "output": "Luxury hotels in Da Nang include InterContinental Da Nang, Hyatt Regency, and Furama Resort."
    },
    {
        "text_input": "Can I do water sports in Da Nang?",
        "output": "Yes, water sports like jet skiing, surfing, and kayaking are popular at My Khe Beach."
    },
    {
        "text_input": "What is Son Tra Peninsula?",
        "output": "Son Tra Peninsula is a nature reserve in Da Nang known for its Linh Ung Pagoda and rare species like the red-shanked douc."
    },
    {
        "text_input": "What can I see at Linh Ung Pagoda?",
        "output": "Linh Ung Pagoda features a 67-meter tall Lady Buddha statue and offers stunning views of the ocean and city."
    },
    {
        "text_input": "What is the best way to explore Da Nang?",
        "output": "The best way to explore Da Nang is by motorbike or taxi. Biking tours are also available for a closer experience."
    },
    {
        "text_input": "What souvenirs can I buy in Da Nang?",
        "output": "Popular souvenirs include marble statues, coconut candies, dried seafood, and silk products."
    },
    {
        "text_input": "Is Da Nang safe for tourists?",
        "output": "Yes, Da Nang is considered one of the safest cities in Vietnam for tourists. However, basic precautions are recommended."
    },
    {
        "text_input": "What is Da Nang known for?",
        "output": "Da Nang is known for its beaches, modern bridges, and as a gateway to Hoi An and Hue."
    },
    {
        "text_input": "What is the Golden Bridge in Bana Hills?",
        "output": "The Golden Bridge in Bana Hills is a pedestrian bridge supported by giant stone hands, offering stunning views."
    },
    {
        "text_input": "Can I take a day trip to Hue from Da Nang?",
        "output": "Yes, Hue is about 100 kilometers from Da Nang and can be visited on a day trip by car or train."
    },
    {
        "text_input": "What is Han River known for?",
        "output": "The Han River is known for its scenic beauty and iconic bridges like Dragon Bridge and Han River Bridge."
    },
    {
        "text_input": "What is the best way to get around Da Nang?",
        "output": "The best way to get around Da Nang is by motorbike or taxi. Grab app is also widely used for ride-hailing."
    },
    {
        "text_input": "What is the cuisine like in Da Nang?",
        "output": "The cuisine in Da Nang features fresh seafood, noodles, and local dishes like Mi Quang and Banh Xeo."
    },
    {
        "text_input": "What is the history of Da Nang?",
        "output": "Da Nang has a rich history, serving as an important port during the Champa Kingdom and later during French colonization."
    },
    {
        "text_input": "What is the Da Nang Cathedral?",
        "output": "The Da Nang Cathedral, also known as the Pink Church, is a beautiful Gothic-style church built in 1923."
    },
    {
        "text_input": "What is the Cham Museum in Da Nang?",
        "output": "The Cham Museum in Da Nang houses the largest collection of Cham artifacts in Vietnam, showcasing their rich culture."
    },
    {
        "text_input": "Are there any nature reserves near Da Nang?",
        "output": "Yes, Son Tra Peninsula is a well-known nature reserve near Da Nang, home to rare species and scenic landscapes."
    },
    {
        "text_input": "What is the nightlife like in Da Nang?",
        "output": "Da Nang has a lively nightlife with bars, clubs, and night markets along the Han River and My Khe Beach."
    },
    {
        "text_input": "Can I do hiking near Da Nang?",
        "output": "Yes, you can hike in the Marble Mountains and Son Tra Peninsula for breathtaking views and natural beauty."
    },
    {
        "text_input": "What is the Da Nang International Airport?",
        "output": "Da Nang International Airport is one of Vietnam's major airports, connecting the city to international and domestic destinations."
    },
    {
        "text_input": "What is the Han Market?",
        "output": "Han Market is a popular spot in Da Nang for local food, souvenirs, and clothing."
    },
    {
        "text_input": "Can I visit My Son Sanctuary from Da Nang?",
        "output": "Yes, My Son Sanctuary is about 70 kilometers from Da Nang and can be reached by car or guided tours."
    },
    {
        "text_input": "What is the best place for seafood in Da Nang?",
        "output": "My Khe Beach area and Han River are popular places to enjoy fresh seafood in Da Nang."
    },
    {
        "text_input": "What are the best beaches in Da Nang?",
        "output": "The best beaches in Da Nang include My Khe Beach, Bac My An Beach, and Non Nuoc Beach."
    },
    {
        "text_input": "Can I do a boat tour in Da Nang?",
        "output": "Yes, boat tours along the Han River are popular for seeing Da Nang's beautiful bridges and city lights."
    },
    {
        "text_input": "What is the Con Market?",
        "output": "Con Market is a bustling local market in Da Nang offering street food, fresh produce, and souvenirs."
    },
    {
        "text_input": "Are there any festivals at Dragon Bridge?",
        "output": "Dragon Bridge features fire and water performances every weekend at 9 PM, attracting large crowds."
    },
    {
        "text_input": "What are some unique activities in Da Nang?",
        "output": "Unique activities in Da Nang include exploring the Marble Mountains, riding the cable car to Bana Hills, and enjoying the fire show at Dragon Bridge."
    },
    {
        "text_input": "What is the My Khe Beach known for?",
        "output": "My Khe Beach is known for its white sand, clear water, and water sports activities like jet skiing and surfing."
    },
    {
        "text_input": "What are the best restaurants in Da Nang?",
        "output": "Some of the best restaurants in Da Nang include Lam Vien Restaurant, Apsara Restaurant, and Sky36 Bar."
    },
    {
        "text_input": "Is Da Nang suitable for solo travelers?",
        "output": "Yes, Da Nang is safe and convenient for solo travelers with plenty of activities and a welcoming environment."
    },
    {
        "text_input": "Can I rent a motorbike in Da Nang?",
        "output": "Yes, motorbike rentals are widely available in Da Nang and are a popular way to explore the city."
    }
]

